keyboardio/ArduinoCore-samd/boards.txt
# Copyright (c) 2014-2015 Arduino LLC.  All right reserved.
#
# This library is free software; you can redistribute it and/or
# modify it under the terms of the GNU Lesser General Public
# License as published by the Free Software Foundation; either
# version 2.1 of the License, or (at your option) any later version.
#
# This library is distributed in the hope that it will be useful,
# but WITHOUT ANY WARRANTY; without even the implied warranty of
# MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.
# See the GNU Lesser General Public License for more details.
#
# You should have received a copy of the GNU Lesser General Public
# License along with this library; if not, write to the Free Software
# Foundation, Inc., 51 Franklin St, Fifth Floor, Boston, MA  02110-1301  USA

menu.cache=Cache
menu.speed=CPU Speed
menu.opt=Optimize
menu.maxqspi=Max QSPI
menu.debug=Debug

# Metro M4 testbed (SAMD51)
# ------------------------------
kbio_metro_m4.name=Metro M4 Keyboard Testbed (SAMD51)
kbio_metro_m4.vid.0=0x239A
kbio_metro_m4.pid.0=0x8020
kbio_metro_m4.vid.1=0x239A
kbio_metro_m4.pid.1=0x0020
kbio_metro_m4.upload.tool=bossac18
kbio_metro_m4.upload.protocol=sam-ba
kbio_metro_m4.upload.maximum_size=507904
kbio_metro_m4.upload.offset=0x4000
kbio_metro_m4.upload.use_1200bps_touch=true
kbio_metro_m4.upload.wait_for_upload_port=true
kbio_metro_m4.upload.native_usb=true
kbio_metro_m4.build.mcu=cortex-m4
#kbio_metro_m4.build.f_cpu=120000000L
kbio_metro_m4.build.usb_product="Metro M4 Testbed"
kbio_metro_m4.build.usb_manufacturer="Keyboardio"
kbio_metro_m4.build.board=METRO_M4
kbio_metro_m4.build.core=arduino
kbio_metro_m4.build.extra_flags=-D__SAMD51J19A__ -DKEYBOARDIO_SAMD_TESTBED -D__SAMD51__ {build.usb_flags} -D__FPU_PRESENT -DARM_MATH_CM4 -mfloat-abi=hard -mfpu=fpv4-sp-d16 '-DKALEIDOSCOPE_HARDWARE_H="Kaleidoscope-Hardware-Keyboardio-SAMDTestbed.h"'
kbio_metro_m4.build.ldscript=linker_scripts/gcc/flash_with_bootloader.ld
kbio_metro_m4.build.openocdscript=openocd_scripts/arduino_zero.cfg
kbio_metro_m4.build.variant=metro_m4
kbio_metro_m4.build.variant_system_lib=
kbio_metro_m4.build.vid=0x239A
kbio_metro_m4.build.pid=0x8020
kbio_metro_m4.bootloader.tool=openocd
kbio_metro_m4.bootloader.file=metroM4/bootloader-metro_m4-v2.0.0-adafruit.5.bin
kbio_metro_m4.compiler.arm.cmsis.ldflags="-L{runtime.tools.CMSIS-5.4.0.path}/CMSIS/Lib/GCC/" "-L{build.variant.path}" -larm_cortexM4lf_math -mfloat-abi=hard -mfpu=fpv4-sp-d16
kbio_metro_m4.menu.cache.on=Enabled
kbio_metro_m4.menu.cache.on.build.cache_flags=-DENABLE_CACHE
kbio_metro_m4.menu.cache.off=Disabled
kbio_metro_m4.menu.cache.off.build.cache_flags=
kbio_metro_m4.menu.speed.120=120 MHz (standard)
kbio_metro_m4.menu.speed.120.build.f_cpu=120000000L
kbio_metro_m4.menu.opt.small=Small (-Os) (standard)
kbio_metro_m4.menu.opt.small.build.flags.optimize=-Os
kbio_metro_m4.menu.maxqspi.50=50 MHz (standard)
kbio_metro_m4.menu.maxqspi.50.build.flags.maxqspi=-DVARIANT_QSPI_BAUD_DEFAULT=50000000
kbio_metro_m4.menu.debug.off=Off
kbio_metro_m4.menu.debug.on=On
kbio_metro_m4.menu.debug.on.build.flags.debug=-g

